blog/2013-08-09-linkfest04082013.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 9.8.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="A lot of cool stuff this week! Statistics and Machine Learning Demand for R jobs on the rise, while SAS jobs decline Statisticians: an endangered &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 9.8.2013</h2>
	<div class="entry-content"><p>
A lot of cool stuff this week!
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://blog.revolutionanalytics.com/2013/08/job-trends-for-statistics-packages.html">Demand for R jobs on the rise, while SAS jobs decline</a>
</li>
<li><a href="http://blog.revolutionanalytics.com/2013/08/statisticians-contemplate-their-own-extinction.html">Statisticians: an endangered species?</a>
</li>
<li><a href="http://statistical-research.com/data-science-statistics-and-the-domain-expert/?utm_source=rss&utm_medium=rss&utm_campaign=data-science-statistics-and-the-domain-expert">Data Scientists and Statisticians: Can’t We All Just Get Along | Statistical Research</a>
</li>
<li><a href="http://simplystatistics.org/2013/08/08/data-scientist-is-just-a-sexed-up-word-for-statistician/#comment-993680252">Data scientist is just a sexed up word for statistician</a>
</li>
<li><a href="http://www.reddit.com/r/MachineLearning/comments/1joh9v/can_someone_explain_kernel_trick_intuitively/?utm_source=twitterfeed&utm_medium=twitter">Can someone explain Kernel Trick intuitively?</a>
</li>
<li><a href="http://codealamode.blogspot.ie/2013/08/bootstrap-confidence-interval-methods.html">Code à la Mode: Bootstrap Confidence Interval Methods in R</a>
</li>
<li><a href="https://hips.seas.harvard.edu/blog/2013/08/01/icml-highlight-fast-dropout-training/">ICML Highlight: Fast Dropout Training</a>
</li>
<li><a href="https://hips.seas.harvard.edu/blog/2013/08/01/icml-highlight-fast-dropout-training/][ICML%20Highlight:%20Fast%20Dropout%20Training%20%E2%80%93%20Building%20Intelligent%20Probabilistic%20Systems]]">Designing Machine Learning Algorithms for Hadoopon</a>
</li>
<li><a href="http://www.reddit.com/r/MachineLearning/comments/1jeawf/machine_learning_books/?utm_source=twitterfeed&utm_medium=twitter">Machine Learning Books</a>
</li>
<li><a href="http://nickqizhu.github.io/d3-cookbook/">D3 Cookbook Recipes</a>
</li>
<li><a href="http://engineering.linkedin.com/event/video-3-big-data-tech-talks-you-can%25E2%2580%2599t-miss">Video: 3 Big Data Tech Talks You Can’t Miss</a>
</li>
<li><a href="http://rpubs.com/jimhester/bigdatabinning">Big Data Binning</a>
</li>
<li><a href="https://www.repository.cam.ac.uk/handle/1810/244707">Maximum likelihood parameter estimation in time series models using sequential Monte Carlo</a>
</li>
<li><a href="http://compneurobio.wordpress.com/2013/07/30/impressions-from-icml-2013/">Impressions from ICML 2013</a>
</li>
<li><a href="http://gallery.rcpp.org/articles/gibbs-sampler/">Gibbs Sampler in C++</a>
</li>
<li><a href="http://blog.revolutionanalytics.com/2013/08/expansion-stay-or-move.html">How to choose a new business location with R</a>
</li>
<li><a href="http://hernanresnizky.wordpress.com/2013/08/02/dashboards-in-r-with-shiny-and-googlevis/">Dashboards in R with Shiny and GoogleVis</a>
</li>
<li><a href="http://timelyportfolio.blogspot.de/2013/08/gridsvganother-glue-for-r-to-svg.html">Timely Portfolio: I Want ggplot2/lattice and d3</a>
</li>
<li><a href="http://statblog.net/2013/03/15/my-time-among-the-statisticians/">My Time Among the Statisticians |</a>
</li>
<li><a href="http://gael-varoquaux.info/blog/?p=169">Scikit-learn 0.14 release: features and benchmarks</a>
</li>
<li><a href="http://vudlab.com/#/learn">Visualizing Urban Data IdeaLab</a>
</li>
<li><a href="http://webscope.sandbox.yahoo.com/catalog.php">Webscope from Yahoo! Labs</a>
</li>
<li><a href="http://radar.oreilly.com/2013/08/podcast-ratings-rankings-and-being-born-lucky.html">Podcast: ratings, rankings, and the advantage of being born lucky - O&#8217;Reilly Radar</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://christophergandrud.github.io/d3Network/">d3Network</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://static.googleusercontent.com/external_content/untrusted_dlcp/research.google.com/en/us/pubs/archive/41159.pdf">Ad Click Prediction: a View from the Trenches</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://julien.danjou.info/blog/2013/guide-python-static-class-astract-methods">The definitive guide on how to use static, class or abstract methods in Python</a>
</li>
<li><a href="http://peekaboo-vision.blogspot.de/2013/07/scikit-learn-sprint-and-014-release.html">Peekaboo: Scikit-learn sprint and 0.14 release candidate</a>
</li>
<li><a href="http://datascience101.wordpress.com/2013/07/31/introduction-to-apache-mahout-slides/">Introduction to Apache Mahout Slides</a>
</li>
<li><a href="http://www.haskellforall.com/">Haskell for all</a>
</li>
<li><a href="http://blog.wolfram.com/2013/07/31/mathematica-gets-bigdata-with-hadooplink/">Mathematica gets Big Data with HadoopLink</a>
</li>
<li><a href="http://prajitr.github.io/quick-haskell-syntax/">A Quick Tour of Haskell Syntax</a>
</li>
<li><a href="http://www.pyregex.com/">PyRegex</a>
</li>
<li><a href="http://www.emacstapas.com/">emacs bites</a>
</li>
<li><a href="https://dataset.readthedocs.org/en/latest/">dataset: databases for lazy people</a>
</li>
<li><a href="http://gettinggeneticsdone.blogspot.de/2013/08/google-developers-r-programming-video.html">R Programming Video Lectures</a>
</li>
<li><a href="http://mosh.mit.edu/">Mosh: the mobile shell</a>
</li>
<li><a href="http://nbviewer.ipython.org/url/jdj.mit.edu/~stevenj/IJulia%252520Preview.ipynb">IJulia Preview</a>
</li>
<li><a href="http://robots.thoughtbot.com/post/2641409235/a-tmux-crash-course#">A Tmux Crash Course</a>
</li>
<li><a href="http://ndpsoftware.com/git-cheatsheet.html">Git Cheatsheet</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-08-09T00:00:00+02:00" pubdate data-updated="true">Aug 9<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2014

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>